In [1]:
%load_ext sql

In [2]:
%sql postgresql://postgres:passwordsql@localhost:5432/acme_co

'Connected: postgres@acme_co'

# Creating the Tables in the Database

In [5]:
%%sql

CREATE TABLE Customer(
    customer_id VARCHAR(100) PRIMARY KEY,
    first_name VARCHAR(30) NOT NULL,
    last_name  VARCHAR(30) NOT NULL,
    address VARCHAR(100) NOT NULL,
    email VARCHAR(100) UNIQUE NOT NULL,
    tel_number VARCHAR(20)                                   
)

 * postgresql://postgres:***@localhost:5432/acme_co
(psycopg2.errors.DuplicateTable) relation "customer" already exists

[SQL: CREATE TABLE Customer(
    customer_id VARCHAR(100) PRIMARY KEY,
    first_name VARCHAR(30) NOT NULL,
    last_name  VARCHAR(30) NOT NULL,
    address VARCHAR(100) NOT NULL,
    email VARCHAR(100) UNIQUE NOT NULL,
    tel_number VARCHAR(20)
)]
(Background on this error at: https://sqlalche.me/e/14/f405)

In [6]:
%%sql

CREATE TABLE Orders(
    order_id VARCHAR(100) PRIMARY KEY,
    order_date DATE NOT NULL,
    total_price DECIMAL(10,2) NOT NULL CHECK (total_price >0),
    customer_id VARCHAR(100) NOT NULL,
    FOREIGN KEY (customer_id) REFERENCES Customer(customer_id)
)

 * postgresql://postgres:***@localhost:5432/acme_co
(psycopg2.errors.DuplicateTable) relation "orders" already exists

[SQL: CREATE TABLE Orders(
    order_id VARCHAR(100) PRIMARY KEY,
    order_date DATE NOT NULL,
    total_price DECIMAL(10,2) NOT NULL CHECK (total_price >0),
    customer_id VARCHAR(100) NOT NULL,
    FOREIGN KEY (customer_id) REFERENCES Customer(customer_id)
)]
(Background on this error at: https://sqlalche.me/e/14/f405)

In [7]:
%%sql

CREATE TABLE Payment(
    payment_id VARCHAR(100) PRIMARY KEY,
    payment_date DATE NOT NULL,
    amount DECIMAL(10,2) NOT NULL CHECK (amount > 0),
    customer_id VARCHAR(100) NOT NULL,
    order_id VARCHAR(100) NOT NULL,
    FOREIGN KEY (customer_id) REFERENCES Customer(customer_id),
    FOREIGN KEY (order_id) REFERENCES Orders(order_id)
)

 * postgresql://postgres:***@localhost:5432/acme_co
(psycopg2.errors.DuplicateTable) relation "payment" already exists

[SQL: CREATE TABLE Payment(
    payment_id VARCHAR(100) PRIMARY KEY,
    payment_date DATE NOT NULL,
    amount DECIMAL(10,2) NOT NULL CHECK (amount > 0),
    customer_id VARCHAR(100) NOT NULL,
    order_id VARCHAR(100) NOT NULL,
    FOREIGN KEY (customer_id) REFERENCES Customer(customer_id),
    FOREIGN KEY (order_id) REFERENCES Orders(order_id)
)]
(Background on this error at: https://sqlalche.me/e/14/f405)

In [8]:
%%sql

CREATE TABLE Product(
    product_id VARCHAR(100) PRIMARY KEY,
    SKU VARCHAR(100) UNIQUE NOT NULL,
    product_price DECIMAL(10,2) NOT NULL CHECK(product_price > 0),
    stock INTEGER NOT NULL CHECK (stock >= 0)
)

 * postgresql://postgres:***@localhost:5432/acme_co
(psycopg2.errors.DuplicateTable) relation "product" already exists

[SQL: CREATE TABLE Product(
    product_id VARCHAR(100) PRIMARY KEY,
    SKU VARCHAR(100) UNIQUE NOT NULL,
    product_price DECIMAL(10,2) NOT NULL CHECK(product_price > 0),
    stock INTEGER NOT NULL CHECK (stock >= 0)
)]
(Background on this error at: https://sqlalche.me/e/14/f405)

In [9]:
%%sql

CREATE TABLE OrderItems(
    orderitem_id VARCHAR(100) PRIMARY KEY,
    quantity DECIMAL NOT NULL CHECK(quantity>0),
    order_id VARCHAR(100) NOT NULL,
    product_id VARCHAR(100) NOT NULL,
    FOREIGN KEY (order_id) REFERENCES Orders(order_id),
    FOREIGN KEY (product_id) REFERENCES Product(product_id)
)

 * postgresql://postgres:***@localhost:5432/acme_co
(psycopg2.errors.DuplicateTable) relation "orderitems" already exists

[SQL: CREATE TABLE OrderItems(
    orderitem_id VARCHAR(100) PRIMARY KEY,
    quantity DECIMAL NOT NULL CHECK(quantity>0),
    order_id VARCHAR(100) NOT NULL,
    product_id VARCHAR(100) NOT NULL,
    FOREIGN KEY (order_id) REFERENCES Orders(order_id),
    FOREIGN KEY (product_id) REFERENCES Product(product_id)
)]
(Background on this error at: https://sqlalche.me/e/14/f405)

In [10]:
%%sql 

CREATE TABLE Shipment(
    shipment_id VARCHAR(100) PRIMARY KEY,
    shipment_date DATE NOT NULL,
    order_id VARCHAR(100) NOT NULL,
    customer_id VARCHAR(100) NOT NULL,
    FOREIGN KEY (customer_id) REFERENCES Customer(customer_id),
    FOREIGN KEY (order_id) REFERENCES Orders(order_id)
)

 * postgresql://postgres:***@localhost:5432/acme_co
(psycopg2.errors.DuplicateTable) relation "shipment" already exists

[SQL: CREATE TABLE Shipment(
    shipment_id VARCHAR(100) PRIMARY KEY,
    shipment_date DATE NOT NULL,
    order_id VARCHAR(100) NOT NULL,
    customer_id VARCHAR(100) NOT NULL,
    FOREIGN KEY (customer_id) REFERENCES Customer(customer_id),
    FOREIGN KEY (order_id) REFERENCES Orders(order_id)
)]
(Background on this error at: https://sqlalche.me/e/14/f405)

# Inserting values into the tables

In [11]:
%%sql

INSERT INTO customer (customer_id, first_name, last_name, address, email, tel_number) VALUES
('CUST2', 'Owen', 'O Sculley', 'VIA FRANCESCO CRISPI, 25', 'oosculley1@scientificamerican.com', '915-477-9398'),
('CUST3', 'Janice', 'Kyne', 'Lutherplatz 3', 'jkyne2@alibaba.com', '747-533-5368'),
('CUST4', 'Laird', 'Stanett', 'P O BOX 440', 'lstanett3@walmart.com', '104-584-8907'),
('CUST5', 'Eduino', 'Minster', 'PIAZZA FILIPPO MEDA 4', 'eminster4@i2i.jp', '234-106-6345'),
('CUST6', 'Florri', 'Keasy', 'Raiffeisenstra√üe 4', 'fkeasy5@clickbank.net', '877-688-7307'),
('CUST7', 'Pinchas', 'Vido', 'Keizer Karelstraat, 15', 'pvido6@umn.edu', '627-346-8242'),
('CUST8', 'Daveen', 'Newarte', 'PO BOX 27025, VA2-430-01-01', 'dnewarte7@imgur.com', '978-480-7408'),
('CUST9', 'Hansiain', 'Poluzzi', '16 BOULEVARD DES ITALIENS', 'hpoluzzi8@omniture.com', '551-204-6192'),
('CUST10', 'Nikaniki', 'Sewall', '10 BOULEVARD DE GRENELLE', 'nsewall9@smugmug.com', '210-355-9235')

 * postgresql://postgres:***@localhost:5432/acme_co
9 rows affected.

[]

In [12]:
%%sql

INSERT INTO orders (order_id, order_date, total_price, customer_id) VALUES
('ORD1', '2024-08-01 12:01:14', 294.15, 'CUST7'),
('ORD2', '2024-10-08 10:00:59', 129.23, 'CUST9'),
('ORD3', '2024-10-07 10:39:23', 118.39, 'CUST6'),
('ORD4', '2024-08-22 03:46:08', 204.36, 'CUST6'),
('ORD5', '2025-02-01 09:02:59', 129.03, 'CUST10'),
('ORD6', '2025-04-15 08:11:10', 51.96, 'CUST2'),
('ORD7', '2025-02-18 00:30:26', 297.07, 'CUST5'),
('ORD8', '2024-10-08 18:31:37', 218.12, 'CUST10'),
('ORD9', '2024-07-20 22:14:45', 224.35, 'CUST5'),
('ORD10', '2025-03-21 17:23:02', 214.02, 'CUST4'),
('ORD11', '2025-04-25 00:12:58', 116.79, 'CUST9'),
('ORD12', '2024-09-02 22:32:29', 266.96, 'CUST6'),
('ORD13', '2025-01-29 14:55:19', 244.4, 'CUST5'),
('ORD14', '2025-03-29 07:20:57', 67.95, 'CUST1'),
('ORD15', '2025-05-04 09:09:25', 44.79, 'CUST8'),
('ORD16', '2025-03-01 00:25:25', 222.45, 'CUST9'),
('ORD17', '2025-05-10 10:59:46', 35.53, 'CUST5'),
('ORD18', '2025-04-19 12:35:21', 272.65, 'CUST4'),
('ORD19', '2025-02-22 23:58:50', 210.3, 'CUST2'),
('ORD20', '2024-06-17 15:25:02', 240.63, 'CUST5')

 * postgresql://postgres:***@localhost:5432/acme_co
20 rows affected.

[]

In [14]:
%%sql

INSERT INTO payment (payment_id, payment_date, amount, customer_id, order_id) VALUES
('PAY1', '2025-05-23 23:26:33', 294.15, 'CUST7', 'ORD1'),
('PAY2', '2024-09-19 14:10:19', 129.23, 'CUST9', 'ORD2'),
('PAY3', '2024-07-05 15:05:53', 118.39, 'CUST6', 'ORD3'),
('PAY4', '2024-06-26 18:41:48', 204.36, 'CUST6', 'ORD4'),
('PAY5', '2024-10-14 16:45:24', 129.03, 'CUST10', 'ORD5'),
('PAY6', '2024-07-14 19:02:30', 51.96, 'CUST2', 'ORD6'),
('PAY7', '2024-06-15 08:19:04', 297.07, 'CUST5', 'ORD7'),
('PAY8', '2024-11-07 09:58:20', 218.12, 'CUST10', 'ORD8'),
('PAY9', '2025-04-28 01:30:25', 224.35, 'CUST5', 'ORD9'),
('PAY10', '2024-08-19 04:38:50', 214.02, 'CUST4', 'ORD10'),
('PAY11', '2025-01-11 03:32:38', 116.79, 'CUST9', 'ORD11'),
('PAY12', '2025-04-24 12:23:41', 266.96, 'CUST6', 'ORD12'),
('PAY13', '2024-12-10 21:34:23', 244.4, 'CUST5', 'ORD13'),
('PAY14', '2025-01-20 08:25:34', 67.95, 'CUST1', 'ORD14'),
('PAY15', '2024-12-22 19:29:05', 44.79, 'CUST8', 'ORD15'),
('PAY16', '2024-10-16 17:18:02', 222.45, 'CUST9', 'ORD16'),
('PAY17', '2025-01-18 13:13:31', 35.53, 'CUST5', 'ORD17'),
('PAY18', '2025-04-09 08:41:55', 272.65, 'CUST4', 'ORD18'),
('PAY19', '2024-07-29 05:25:16', 210.3, 'CUST2', 'ORD19'),
('PAY20', '2024-12-20 12:24:58', 240.63, 'CUST5', 'ORD20')

 * postgresql://postgres:***@localhost:5432/acme_co
20 rows affected.

[]

In [16]:
%%sql

INSERT INTO product (product_id, SKU, product_price, stock) VALUES
('PROD1', 'SKU-2863423', 4.93, 119),
('PROD2', 'SKU-7716406', 1.29, 161),
('PROD3', 'SKU-7557273', 4.82, 127),
('PROD4', 'SKU-0573692', 14.73, 110),
('PROD5', 'SKU-8620911', 11.02, 128),
('PROD6', 'SKU-2710079', 7.06, 196),
('PROD7', 'SKU-9908738', 12.92, 198),
('PROD8', 'SKU-7109858', 1.11, 97),
('PROD9', 'SKU-3316378', 4.14, 176),
('PROD10', 'SKU-0475983', 3.75, 197),
('PROD11', 'SKU-5535400', 5.28, 158),
('PROD12', 'SKU-4506993', 13.67, 73),
('PROD13', 'SKU-0863641', 8.44, 140),
('PROD14', 'SKU-8808828', 2.3, 155),
('PROD15', 'SKU-4831061', 12.05, 118),
('PROD16', 'SKU-9991544', 5.87, 92),
('PROD17', 'SKU-5616122', 14.02, 92),
('PROD18', 'SKU-7481486', 8.99, 122),
('PROD19', 'SKU-3332449', 4.59, 196),
('PROD20', 'SKU-0553697', 5.55, 83),
('PROD21', 'SKU-4099509', 14.62, 82),
('PROD22', 'SKU-9402834', 1.4, 89),
('PROD23', 'SKU-5955435', 10.13, 126),
('PROD24', 'SKU-8010754', 4.41, 165),
('PROD25', 'SKU-4726937', 10.19, 200),
('PROD26', 'SKU-1659244', 13.53, 87),
('PROD27', 'SKU-3778479', 8.36, 92),
('PROD28', 'SKU-4770546', 13.14, 95),
('PROD29', 'SKU-8784054', 1.31, 179),
('PROD30', 'SKU-3868203', 5.08, 157),
('PROD31', 'SKU-4138277', 3.71, 193),
('PROD32', 'SKU-8156145', 7.0, 186),
('PROD33', 'SKU-8163968', 4.46, 83),
('PROD34', 'SKU-3265288', 10.17, 107),
('PROD35', 'SKU-7761661', 6.8, 118),
('PROD36', 'SKU-0257112', 6.5, 142),
('PROD37', 'SKU-9258228', 1.14, 164),
('PROD38', 'SKU-0178007', 5.98, 125),
('PROD39', 'SKU-1902847', 6.17, 113),
('PROD40', 'SKU-2090225', 2.52, 84),
('PROD41', 'SKU-2874435', 5.17, 140),
('PROD42', 'SKU-7491834', 3.51, 139),
('PROD43', 'SKU-7799370', 1.59, 113),
('PROD44', 'SKU-8099319', 2.72, 94),
('PROD45', 'SKU-4315593', 6.13, 151),
('PROD46', 'SKU-2568225', 1.48, 139),
('PROD47', 'SKU-8064656', 10.65, 146),
('PROD48', 'SKU-7844000', 14.27, 73),
('PROD49', 'SKU-1875652', 10.57, 184),
('PROD50', 'SKU-5040708', 2.11, 77)

 * postgresql://postgres:***@localhost:5432/acme_co
50 rows affected.

[]

In [17]:
%%sql

INSERt INTO orderitems(orderitem_id, quantity, order_id, product_id) VALUES

('ORDITEM1', 28, 'ORD1', 'PROD32'),
('ORDITEM2', 16, 'ORD2', 'PROD33'),
('ORDITEM3', 21, 'ORD3', 'PROD2'),
('ORDITEM4', 25, 'ORD4', 'PROD3'),
('ORDITEM5', 20, 'ORD5', 'PROD17'),
('ORDITEM6', 6, 'ORD6', 'PROD1'),
('ORDITEM7', 32, 'ORD7', 'PROD18'),
('ORDITEM8', 35, 'ORD8', 'PROD18'),
('ORDITEM9', 3, 'ORD9', 'PROD13'),
('ORDITEM10', 27, 'ORD10', 'PROD17'),
('ORDITEM11', 3, 'ORD11', 'PROD14'),
('ORDITEM12', 1, 'ORD12', 'PROD14'),
('ORDITEM13', 46, 'ORD13', 'PROD6'),
('ORDITEM14', 26, 'ORD14', 'PROD38'),
('ORDITEM15', 32, 'ORD15', 'PROD19'),
('ORDITEM16', 23, 'ORD16', 'PROD28'),
('ORDITEM17', 13, 'ORD17', 'PROD29'),
('ORDITEM18', 6, 'ORD18', 'PROD32'),
('ORDITEM19', 26, 'ORD19', 'PROD33'),
('ORDITEM20', 25, 'ORD20', 'PROD29'),
('ORDITEM21', 5, 'ORD1', 'PROD38'),
('ORDITEM22', 21, 'ORD2', 'PROD25'),
('ORDITEM23', 23, 'ORD3', 'PROD22'),
('ORDITEM24', 4, 'ORD4', 'PROD4'),
('ORDITEM25', 1, 'ORD5', 'PROD9'),
('ORDITEM26', 8, 'ORD6', 'PROD2'),
('ORDITEM27', 13, 'ORD7', 'PROD31'),
('ORDITEM28', 36, 'ORD8', 'PROD22'),
('ORDITEM29', 48, 'ORD9', 'PROD9'),
('ORDITEM30', 2, 'ORD10', 'PROD34')

 * postgresql://postgres:***@localhost:5432/acme_co
30 rows affected.

[]

In [18]:
%%sql

INSERT INTO shipment (shipment_id, shipment_date, order_id, customer_id) VALUES
('SHIP1', '2024-11-23 08:23:44', 'ORD1', 'CUST7'),
('SHIP2', '2025-01-16 22:00:28', 'ORD2', 'CUST9'),
('SHIP3', '2025-02-19 07:53:22', 'ORD3', 'CUST6'),
('SHIP4', '2024-12-22 23:22:47', 'ORD4', 'CUST6'),
('SHIP5', '2025-05-15 22:37:59', 'ORD5', 'CUST10'),
('SHIP6', '2025-03-12 13:26:35', 'ORD6', 'CUST2'),
('SHIP7', '2024-07-29 22:19:29', 'ORD7', 'CUST5'),
('SHIP8', '2025-01-08 05:05:55', 'ORD8', 'CUST10'),
('SHIP9', '2024-07-28 17:42:13', 'ORD9', 'CUST5'),
('SHIP10', '2025-01-03 07:22:21', 'ORD10', 'CUST4'),
('SHIP11', '2025-02-13 17:37:10', 'ORD11', 'CUST9'),
('SHIP12', '2024-12-23 15:43:10', 'ORD12', 'CUST6'),
('SHIP13', '2024-10-11 20:42:43', 'ORD13', 'CUST5'),
('SHIP14', '2025-03-15 04:19:55', 'ORD14', 'CUST1'),
('SHIP15', '2025-02-05 02:58:59', 'ORD15', 'CUST8'),
('SHIP16', '2024-10-17 09:25:10', 'ORD16', 'CUST9'),
('SHIP17', '2025-04-12 00:21:12', 'ORD17', 'CUST5'),
('SHIP18', '2025-01-07 08:26:48', 'ORD18', 'CUST4'),
('SHIP19', '2024-07-02 07:25:41', 'ORD19', 'CUST2'),
('SHIP20', '2024-08-20 16:03:45', 'ORD20', 'CUST5')

 * postgresql://postgres:***@localhost:5432/acme_co
20 rows affected.

[]

# SQL Queries for Customer and Revenue Insights

In [5]:
%%sql
SELECT customer.customer_id, CONCAT(first_name, '', last_name) AS fullname, SUM(amount) AS total_spent
FROM payment
JOIN customer ON payment.customer_id = customer.customer_id
GROUP BY customer.customer_id, fullname
ORDER BY total_spent DESC
LIMIT 5

 * postgresql://postgres:***@localhost:5432/acme_co
5 rows affected.

[('CUST5', 'EduinoMinster', Decimal('1041.98')),
 ('CUST6', 'FlorriKeasy', Decimal('589.71')),
 ('CUST4', 'LairdStanett', Decimal('486.67')),
 ('CUST9', 'HansiainPoluzzi', Decimal('468.47')),
 ('CUST10', 'NikanikiSewall', Decimal('347.15'))]

Top 5 Customers by Total Spending - Identifies VIP customers to target with loyalty programs or premium services.

In [6]:
%%sql
SELECT DATE_TRUNC('month', payment_date) AS payment_month, SUM(amount) AS monthly_revenue 
FROM payment
GROUP BY payment_month
ORDER BY monthly_revenue DESC

 * postgresql://postgres:***@localhost:5432/acme_co
10 rows affected.

[(datetime.datetime(2025, 4, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=3600))), Decimal('763.96')),
 (datetime.datetime(2024, 12, 1, 0, 0, tzinfo=datetime.timezone.utc), Decimal('529.82')),
 (datetime.datetime(2024, 6, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=3600))), Decimal('501.43')),
 (datetime.datetime(2024, 7, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=3600))), Decimal('380.65')),
 (datetime.datetime(2024, 10, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=3600))), Decimal('351.48')),
 (datetime.datetime(2025, 5, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=3600))), Decimal('294.15')),
 (datetime.datetime(2025, 1, 1, 0, 0, tzinfo=datetime.timezone.utc), Decimal('220.27')),
 (datetime.datetime(2024, 11, 1, 0, 0, tzinfo=datetime.timezone.utc), Decimal('218.12')),
 (datetime.datetime(2024, 8, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=3600))), Decimal('214.02')),
 (datetime.datetime(2024, 9, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=3600))), Decimal('129.23'))]

Monthly Revenue Trend - Helps management understand seasonality or revenue growth trends.

In [10]:
%%sql
SELECT customer.customer_id, CONCAT(first_name, ' ', last_name) AS fullname, COUNT(orders.order_id), 
SUM(orders.total_price) AS total_spent,
ROUND(AVG(orders.total_price),2) AS avg_order_value
FROM Orders
JOIN customer on orders.customer_id = customer.customer_id
GROUP BY customer.customer_id, fullname

 * postgresql://postgres:***@localhost:5432/acme_co
9 rows affected.

[('CUST6', 'Florri Keasy', 3, Decimal('589.71'), Decimal('196.57')),
 ('CUST8', 'Daveen Newarte', 1, Decimal('44.79'), Decimal('44.79')),
 ('CUST2', 'Owen O Sculley', 2, Decimal('262.26'), Decimal('131.13')),
 ('CUST9', 'Hansiain Poluzzi', 3, Decimal('468.47'), Decimal('156.16')),
 ('CUST1', 'Hill Radnedge', 1, Decimal('67.95'), Decimal('67.95')),
 ('CUST7', 'Pinchas Vido', 1, Decimal('294.15'), Decimal('294.15')),
 ('CUST5', 'Eduino Minster', 5, Decimal('1041.98'), Decimal('208.40')),
 ('CUST10', 'Nikaniki Sewall', 2, Decimal('347.15'), Decimal('173.58')),
 ('CUST4', 'Laird Stanett', 2, Decimal('486.67'), Decimal('243.34'))]

Average Order Value per Customer - Measures customer purchasing behaviour to inform segmentation and marketing.